ObjectStorage/src/Catalogs/ох_НастройкиРегистрацииФайловОбъектногоХранилища/ох_НастройкиРегистрацииФайловОбъектногоХранилища.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ох_НастройкиРегистрацииФайловОбъектногоХранилища</name>
  <attributes>
    <name>Использовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СервисныйАккаунт</name>
    <type>
      <types>CatalogRef.ох_СервисныеАккаунтыОбъектныхХранилищ</types>
    </type>
  </attributes>
  <attributes>
    <name>Бакет</name>
    <type>
      <types>CatalogRef.ох_БакетыОбъектныхХранилищ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеИмяФункцииРегистрации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОбъектыРегистрации</name>
    <attributes>
      <name>ПолноеИмяОбъекта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ObjectStorage/src/CommonModules/ох_РегистрацияФайловОбъектногоХранилища/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

Процедура РегистрацияФайловОбъектногоХранилищаПриЗаписи(Источник, Отказ) Экспорт
	ЗарегистрироватьФайлыХранилища(Источник, Отказ);
КонецПроцедуры

Процедура РегистрацияФайловОбъектногоХранилищаПередУдалением(Источник, Отказ) Экспорт
	ЗарегистрироватьФайлыХранилища(Источник, Отказ, Истина);
КонецПроцедуры

Процедура РегистрацияФайловОбъектногоХранилищаПриЗаписиНабораЗаписей(Источник, Отказ, Замещение) Экспорт
	ЗарегистрироватьФайлыХранилища(Источник, Отказ);
КонецПроцедуры

#Область ПереопределяемыеМетодыРегистраций

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗарегистрироватьФайлыХранилища(Источник, Отказ, ЭтоУдаление = Ложь)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Источник.ОбменДанными.Загрузка
		Или Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ох_ОбъектноеХранилище.ИнтеграцияДоступна() Тогда
		Возврат;
	КонецЕсли;
	
	ПолноеИмяОбъекта = Метаданные.НайтиПоТипу(ТипЗнч(Источник)).ПолноеИмя();
	НастройкиРегистрации = НастройкиРегистрацииОбъекта(ПолноеИмяОбъекта);
	
	ПараметрыМетода = ох_ОбщегоНазначенияКлиентСервер.ЗначенияВМассиве(Источник, ЭтоУдаление);
	
	Пока НастройкиРегистрации.Следующий() Цикл
		
		Попытка
			
			Если Не ПустаяСтрока(НастройкиРегистрации.ПолноеИмяФункцииРегистрации) Тогда
				ИмяМетода = НастройкиРегистрации.ПолноеИмяФункцииРегистрации;
			Иначе
				ИмяМетода = "ох_РегистрацияФайловОбъектногоХранилища.РегистрацияФайловПоУмолчанию";
			КонецЕсли;
			
			ДанныеРегистрации = ох_ОбщегоНазначения.ВыполнитьМетодКонфигурации(ИмяМетода, ПараметрыМетода, Истина);
			
			Если Не ДанныеРегистрации.Количество() Тогда
				Продолжить;
			КонецЕсли;
			
			ПараметрыРаботыОбъектногоХранилища = ох_ОбъектноеХранилище.НовыйПараметрыРаботыСОбъектнымХранилищем(); 
			ПараметрыРаботыОбъектногоХранилища.СервисныйАккаунт = НастройкиРегистрации.СервисныйАккаунт;
			ПараметрыРаботыОбъектногоХранилища.Бакет            = НастройкиРегистрации.Бакет;
			
			Для Каждого Данные Из ДанныеРегистрации Цикл
				ЗарегистрироватьФайл(Данные, ПараметрыРаботыОбъектногоХранилища);
			КонецЦикла;
			
		Исключение
			
			ЗаписьЖурналаРегистрации(
				"Объектное хранилище.Регистрация заданий обработки файлов",
				УровеньЖурналаРегистрации.Ошибка,
				,
				НастройкиРегистрации.Ссылка,
				ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

Функция НастройкиРегистрацииОбъекта(ПолноеИмяОбъекта)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ох_НастройкиРегистрацииФайловОбъектногоХранилищаОбъектыРегистрации.Ссылка.СервисныйАккаунт КАК СервисныйАккаунт,
		|	ох_НастройкиРегистрацииФайловОбъектногоХранилищаОбъектыРегистрации.Ссылка.Бакет КАК Бакет,
		|	ох_НастройкиРегистрацииФайловОбъектногоХранилищаОбъектыРегистрации.Ссылка.ПолноеИмяФункцииРегистрации КАК ПолноеИмяФункцииРегистрации,
		|	ох_НастройкиРегистрацииФайловОбъектногоХранилищаОбъектыРегистрации.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ох_НастройкиРегистрацииФайловОбъектногоХранилища.ОбъектыРегистрации КАК ох_НастройкиРегистрацииФайловОбъектногоХранилищаОбъектыРегистрации
		|ГДЕ
		|	ох_НастройкиРегистрацииФайловОбъектногоХранилищаОбъектыРегистрации.ПолноеИмяОбъекта = &ПолноеИмяОбъекта
		|	И НЕ ох_НастройкиРегистрацииФайловОбъектногоХранилищаОбъектыРегистрации.Ссылка.ПометкаУдаления
		|	И ох_НастройкиРегистрацииФайловОбъектногоХранилищаОбъектыРегистрации.Ссылка.Использовать";
	
	Запрос.УстановитьПараметр("ПолноеИмяОбъекта", ПолноеИмяОбъекта);
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

Процедура ЗарегистрироватьФайл(ПараметрыРегистрации, ПараметрыРаботыОбъектногоХранилища)
	
	Файл          = ПараметрыРегистрации.Файл;
	ВладелецФайла = ПараметрыРегистрации.Владелец;
	Операция      = ПараметрыРегистрации.Операция;

	Если Операция = ОперацияВыгрузки() Тогда
		ох_ОбъектноеХранилище.ЗарегистрироватьФайлДляВыгрузки(Файл, ПараметрыРаботыОбъектногоХранилища, ВладелецФайла);
	ИначеЕсли Операция = ОперацияУдаления() Тогда
		ох_ОбъектноеХранилище.ЗарегистрироватьФайлДляУдаления(Файл, ПараметрыРаботыОбъектногоХранилища, ВладелецФайла);
	Иначе
		ВызватьИсключение СтрШаблон(
			"Некорректная операция над файлом: %1 (доступны только операции Выгрузка/Удаление)",
			Операция);
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьДанныеРегистрации(ДанныеРегистрации, Файл, Владелец, Операция)
	
	НоваяСтрока = ДанныеРегистрации.Добавить();
	
	НоваяСтрока.Файл     = Файл;
	НоваяСтрока.Владелец = Владелец;
	НоваяСтрока.Операция = Операция;
	
КонецПроцедуры

Функция НовыйДанныеРегистрации()
	
	ДанныеРегистрации = Новый ТаблицаЗначений;
	
	ДанныеРегистрации.Колонки.Добавить("Файл");
	ДанныеРегистрации.Колонки.Добавить("Владелец");
	ДанныеРегистрации.Колонки.Добавить("Операция");
	
	Возврат ДанныеРегистрации;
	
КонецФункции

Функция Операция(Файл, Знач ПометкаУдаления = Неопределено)
	
	Если ПометкаУдаления = Неопределено Тогда
		ПометкаУдаления = ох_ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Файл, "ПометкаУдаления");
	КонецЕсли;
	
	Возврат ?(ПометкаУдаления, ОперацияУдаления(), ОперацияВыгрузки());
	
КонецФункции

Функция ОперацияВыгрузки()
	Возврат "Выгрузка";
КонецФункции

Функция ОперацияУдаления()
	Возврат "Удаление";
КонецФункции

Функция ЭтоСправочникПрисоединенныхФайлов(СправочникФайлов)
	
	ТипСправочника = ТипЗнч(СправочникФайлов.Ссылка);
	
	Возврат Метаданные.ОпределяемыеТипы.ох_ПрисоединенныеФайлыОбъектногоХранилища.Тип.СодержитТип(ТипСправочника)
		Или  Метаданные.ОпределяемыеТипы.ох_ВладелецПрисоединенныхФайловОбъектногоХранилища.Тип.СодержитТип(ТипСправочника);
	
КонецФункции

#Область МетодыРегистрации

#Область МетодыПоУмолчанию

Функция РегистрацияФайловПоУмолчанию(Источник, ЭтоУдаление = Ложь) Экспорт
	
	ДанныеРегистрации = НовыйДанныеРегистрации();
	
	Если ЭтоСправочникПрисоединенныхФайлов(Источник) Тогда
		
		ДобавитьДанныеРегистрации(
			ДанныеРегистрации,
			Источник.Ссылка,
			Источник.ВладелецФайла,
			Операция(Источник.Ссылка, Источник.ПометкаУдаления Или ЭтоУдаление));
		
	ИначеЕсли ох_ОбщегоНазначения.КОбъектуМожноПрисоединятьФайлы(Источник.Ссылка) Тогда

		ПрисоединенныеФайлы = ох_ОбщегоНазначения.ПрисоединенныеФайлыКОбъекту(Источник.Ссылка, Истина);
		ЗначениеПометкиВладельца =
			ох_ОбщегоНазначения.ЗначенияРеквизитовОбъектов(ПрисоединенныеФайлы, "ВладелецФайла, ПометкаУдаления");
			
		Для Каждого Файл Из ПрисоединенныеФайлы Цикл
			
			ДанныеФайла = ЗначениеПометкиВладельца[Файл];
			
			ДобавитьДанныеРегистрации(
				ДанныеРегистрации,
				Файл,
				ДанныеФайла.ВладелецФайла,
				Операция(Файл, ДанныеФайла.ПометкаУдаления Или ЭтоУдаление));
			
		КонецЦикла;
	
	Иначе
		
		ВызватьИсключение "Регистрировать задания без указания метода в настройках можно только объекты,
		|которые являются хранилищами файлов или владельцами файлов";
		
	КонецЕсли;
	
	Возврат ДанныеРегистрации;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецОбласти
